// 可以自定义快捷键 设置-键盘快捷方式 比如我常用的 "cursor + ;"跳转到行末，比如安装插件可以按Tab键跳出符号.
// alt + 上箭头 / alt + 下箭头 此行与上行交换 / 此行与行交换
// 选中变量按 "F2" 可以在所有位置改变该变量的名字.选中内容再 "ctrl + D" 可以选中当前页面所有该内容,再按 "ctrl + K" 可以跳过下一个选中的内容.
// 在行内光标闪烁状态按 "ctrl + C"可以复制全行，按 "ctrl + X" 可以剪切全行，按 "ctrl + A" 可以选中当前窗口所有内容.
// "ctrl + /" 可以注释或取消注释.
// "F11" 进入全屏 / 退出全屏.
// "ctrl + S" 保存.
// "ctrl + P" 查看最近打开的几个文件,可以在这个输入框里进行模糊查找.
// "ctrl + 右箭头" 每次跳过一个单词,"shift + 箭头" 向对应方向选取范围,二者可以同时使用 "ctrl + shift + 箭头" 快速选取范围.
// "End" 可以快速跳转行尾,"Home" 可以快速跳转行首.
// "Shift + End" 或 "Shift + Home" 可以快速选取此行内容的光标前半部分或光标后半部分.
// "Alt + 上箭头 / 下箭头" 快速复制一行代码.
// "ctrl + 鼠标左键" 添加多个光标.
