// 1137-E-第 N 个泰波那契数
/**
 * @param {number} n
 * @return {number}
 */
// T0 = 0, T1 = 1, T2 = 1,当n>2时，满足Tn = Tn-1 + Tn-2 + Tn-3
// 动态规划滚动数组
// i = 3       i = 4
// p q r s  => p q r s
// 0 0 1 1 2   0 1 1 2 4
// 时间复杂度On
// 空间复杂度O1
var tribonacci = function (n) {
  if (n === 0) return 0;
  if (n <= 2) return 1;
  let p = 0,
    q = 0,
    r = 1,
    s = 1;
  for (let i = 3; i <= n; ++i) {
    p = q;
    q = r;
    r = s;
    s = p + q + r;
  }
  return s;
};

// 检索
var tribonacci = function (n) {
  let result = [0, 1, 1, 2, 4, 7, 13, 24, 44, 81,
    149, 274, 504, 927, 1705, 3136, 5768, 10609, 19513, 35890,
    66012, 121415, 223317, 410744, 755476, 1389537, 2555757, 4700770, 8646064, 15902591,
    29249425, 53798080, 98950096, 181997601, 334745777, 615693474, 1132436852, 2082876103
  ];
  return result[n];
}

// 动态规划
var tribonacci = function (n) {
  if (n <= 1) return n;
  let dp = [0, 1, 1];
  for (let i = 3; i <= n; i++) {
    dp[i] = dp[i - 1] + dp[i - 2] + dp[i - 3];
  }
  return dp[n];
}

// 每次安迪录低级房都会抱怨队友孤儿，11:25秒的时候安迪一句话说的很对，"垃圾房，只配用垃圾态度对待"，巧了，这个游戏多数玩家也是这个态度，大家都不双标，就是简单粗暴的"垃圾房，只配用垃圾态度对待"，没办法，不是所有人玩游戏都回去积极查攻略看视频学习别人的打法，很多人玩游戏就是图一乐，可能玩了几万场还是几百场均四十多胜率，还不知道中坦线重坦线td位，甚至连弹种装甲都不懂，之前那个活动直接一排快车轮番肉侦开送这种人大有人在，可能就是三十多了没时间玩端游了，打开手游玩几把，要是孩子醒了可能直接就挂机哄孩子去了，或者是一个纯纯小学生，就是喜欢收藏坦克，都意识不到自己在坑人，这种pvp游戏就是这样的，顶级玩家有顶级玩家的骄傲，娱乐玩家也有娱乐玩家的自在，各有各的赛场，真不如录一点精彩的技巧对局给愿意提升自己的玩家看，比如中坦线崩了，但自己可以边打边退拉扯，空间换时间，残局少打多怎么转场配合拉炮线，"这波301这个点灯的话我不知道是送m打法还是什么，开局哪有这么点的，开局哪有这么点灯的我cnmb啊"圣经确实有意思我可能看了几十遍了，但我确实期待安迪能做点更有意义的东西，